Ran Plan for project: `grafana-dashboards` dir: `terraform-atlantis-demo` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # grafana_dashboard.demo will be created
+ resource "grafana_dashboard" "demo" {
      + config_json  = jsonencode(
            {
              + panels        = [
                  + {
                      + gridPos = {
                          + h = 8
                          + w = 12
                          + x = 0
                          + y = 0
                        }
                      + options = {
                          + content = <<-EOT
                                # Ey up from Terraform!
                                
                                This dashboard was deployed via:
                                - **GitHub PR**
                                - **Atlantis**
                                - **Terraform**
                                
                                🚀 Infrastructure as Code in action!
                            EOT
                          + mode    = "markdown"
                        }
                      + title   = "Welcome"
                      + type    = "text"
                    },
                  + {
                      + fieldConfig = {
                          + defaults = {
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      + {
                                          + color = "yellow"
                                          + value = 50
                                        },
                                      + {
                                          + color = "red"
                                          + value = 80
                                        },
                                    ]
                                }
                              + unit       = "percent"
                            }
                        }
                      + gridPos     = {
                          + h = 8
                          + w = 6
                          + x = 12
                          + y = 0
                        }
                      + options     = {
                          + colorMode   = "value"
                          + graphMode   = "area"
                          + justifyMode = "auto"
                          + textMode    = "auto"
                        }
                      + targets     = []
                      + title       = "Demo Metric"
                      + type        = "stat"
                    },
                ]
              + refresh       = ""
              + schemaVersion = 38
              + tags          = [
                  + "demo",
                  + "terraform",
                ]
              + timezone      = "browser"
              + title         = "Demo Dashboard"
              + uid           = "demo-dashboard-001"
            }
        )
      + dashboard_id = (known after apply)
      + folder       = (known after apply)
      + id           = (known after apply)
      + overwrite    = true
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # grafana_folder.terraform_managed will be created
+ resource "grafana_folder" "terraform_managed" {
      + id                           = (known after apply)
      + prevent_destroy_if_not_empty = false
      + title                        = "Terraform Managed"
      + uid                          = (known after apply)
      + url                          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p grafana-dashboards
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://4a29eaf05271.ngrok-free.app/lock?id=monodot%252Fgrafana-playground%252Fterraform-atlantis-demo%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p grafana-dashboards
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```